#include<iostream>
using namespace std;
void main()
{
	int s,s1, v, t;
	setlocale(0, "ru");
	cout << "Введите расстояние, которое прошел марафонец(км):\n";
	cin >> s;
	cout << "Введите скорость марафонца(м/с):\n";
	cin >> v;
	int t1 = ((s*1000) / v)/3600;
	int t2 = ((s * 1000) / v)%3600/60;
	int t3 = ((s * 1000) / v) % 3600 / 60%60*0.6;
	cout << "Время за которое марафонец пробежал " << s << " киллометров\n" << " со скоростью " << v << " метров в секунду: " << t1 << " часов " << t2 << " минут " << t3 << " секунд. \n";

	/*double a, b;
	setlocale(0, "ru");
	cout << "Введите первое дробное число (пример 1.2):";
	cin >> a;
	cout << "Введите второе дробное число:";
	cin >> b;
	int b3 = b*100;
	int a3 = a*100;
	int a1 = a3 / 100;
	int b1 = b3 / 100;
	double a2 = a3 % 100;
	double b2 = b3 % 100;
	cout << "Сумма целых частей:" << a1 + b1 << "Сумма дробных частей:" << (a2 + b2)/100;*/
	
	/*int t;
	setlocale(0, "ru");
	cout << "Введите время(сек):\n";
	cin >> t;
	int t1 = t / 86400;
	int t2 = t %86400 / 3600;
	int t3 = t % 86400% 3600/60;
	int t4 = t % 86400 % 3600 % 60 ;
	cout << t << " секунд - это \n" << t1 << " дней " << t2 << " часов " << t3 << " минут \n" << t4 << " секунд.";*/

	/*double s,t,v;
	setlocale(0, "ru");
	cout << "Введите расстояние до аэропорта(км):\n";
	cin >> s;
	cout << "Введите время за которое нужно доехать(минуты):\n";
	cin >> t;
	double t1 = s/t*60;
	cout << "Скорость с которой нужно ехать для приодоления " << s << " киллометров пути\n за " << t << " минут = " << t1 << " киллометров в час\n";*/

	/*double sth,stm,sts, eth,etm,ets;
	setlocale(0, "ru");
	cout << "Введите время начала телефонного разговора(часов):\n";
	cin >> sth;
	cout << "Минут:\n";
	cin >> stm;
	cout << "Секунд:\n";
	cin >> sts;
	cout << "Введите время завершения телефонного разговора(часов):\n";
	cin >> eth;
	cout << "Минут:\n";
	cin >> etm;
	cout << "Секунд:\n";
	cin >> ets; 
	double th = (eth - sth)*3600;
	double tim = (etm - stm) * 60;
	double ts = ets - sts;
	double costcoin = (th + tim + ts) / 4;
	double costnotes = (th + tim + ts) / 400;
	cout << "Стоимость разговора за " << th/3600 << " часа(ов) " << tim/60 << " минут и " << ts << " секунд\n равна " << costcoin << " копейкам или " << costnotes << " рублям.\n";*/